Revit 2024 API
AssetProperty Methods
The AssetProperty type exposes the following members.
Methods
Name | Description
AddConnectedAsset
 Adds a new connected asset attached to this asset property, if it allows it.
AddCopyAsConnectedAsset
 Makes a copy of the asset and connects it to this property.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAllConnectedProperties
 Gets the list of the connected properties. Connected properties are the detachable properties of an AssetProperty. e.g. diffuse property can have texture as its connected property. It can also detach texture on runtime.
GetConnectedProperty
 Gets one connected property with specified index.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetSingleConnectedAsset
 Gets the single connected asset attached to this asset property, if it exists.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetTypeName
Get the name of the AssetProperty
IsEditable
 Check if property can be edited.
IsValidSchemaIdentifier
 Check that schema name is valid
RemoveConnectedAsset
 Removes the connected asset attached to this asset property if any.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace